bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
csholmq.excel-to-markdown-table
github.copilot
github.copilot-chat
janisdd.vscode-edit-csv
jeff-hykin.better-cpp-syntax
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
moshfeu.compare-folders
ms-ceintl.vscode-language-pack-ja
ms-python.autopep8
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.vscode-serial-monitor
shd101wyy.markdown-preview-enhanced
yzhang.markdown-all-in-one